Revit 2027 API
DimensionEqualityLabelFormatting.IsValidFormatOptions Method
 Checks whether a FormatOptions object is valid for the LabelType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFormatOptions()
Public Function IsValidFormatOptions As Boolean
public:
bool IsValidFormatOptions()
member IsValidFormatOptions : unit -> bool
Return Value
Boolean
 True if the FormatOptions object is valid, false otherwise.
Remarks
 Only objects whose LabelType is LengthOfSegment or TotalLength can have FormatOptions assigned.
See Also
Reference
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace